W6D599Cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
    def index
        # debugger
        @cats = Cat.all

INSERT INTO "cats" ("birth_date", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["birth_date", "2021-03-28"], ["name", "seb"], ["sex", ""], ["description", " hello"], ["created_at", "2021-04-02 21:14:21.388106"], ["updated_at", "2021-04-02 21:14:21.388106"]]
---
    def create
        # debugger
        @cat = Cat.new(cat_params)

        if @cat.save